package com.example.compose

data class Dhikr(
    val text: String,
    val initialCount: Int,
    val type: String,
    val desc: String? = null,
    val title: String? = null
)

val Adhkar = listOf(
    Dhikr(
        text = "اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيم",
        initialCount = 1,
        "morning"
    ),
    Dhikr(
        text = "قُلْ هُوَ اللَّهُ أَحَدٌ*اللَّهُ الصَّمَدُ*لَمْ يَلِدْ وَلَمْ يُولَدْ * وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ * مِن شَرِّ مَا خَلَقَ *وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ * وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ * وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "قُلْ أَعُوذُ بِرَبِّ النَّاسِ * مَلِكِ النَّاسِ * إِلَهِ النَّاسِ *مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ * الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ * مِنَ الْجِنَّةِ وَالنَّاسٌِ",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "أصبحنا وأصبح الملك لله والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم وخير ما بعده وأعوذ بك من شر ما في هذا اليوم وشر ما بعده ربِّ أعوذ بك من الكسل وسوء الكبر، ربَّ أعوذ بك من عذابٍ في النار وعذاب في القبر",
        initialCount = 1,
        "morning"
    ),
    Dhikr(
        text = "اللهمَّ أنت ربي لا إله إلا أنت، خلقتَني وأنا عبدُك، وأنا على عهدك ووعدك ما استطعتُ، أعوذُ بك من شرِّ ما صنعتُ، أبوء لك بنعمتك عليَّ، وأبوءُ لك بذنبي، فاغفر لي؛ فإنه لا يغفر الذنوب إلا أنت",
        initialCount = 1,
        "morning"
    ),
    Dhikr(
        text = "رضيت بالله ربًّا، وبالإسلام دينًا، وبمحمد صلى الله عليه وسلم نبيًّا",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "اللهم إني أصبحت أشهدك وأشهد حملة عرشك، وملائكتك وجميع خلقك، أنك أنت الله لا إله إلا أنت وحدك لا شريك لك ، وأن محمداً عبدك ورسولك",
        initialCount = 4,
        "morning"
    ),
    Dhikr(
        text = "اللهم ما أصبح بي من نعمةٍ أو بأحدٍ من خلقك فمنك وحدك لا شريك لك، فلك الحمد ولك الشكر",
        initialCount = 1,
        "morning"
    ),
    Dhikr(
        text = "حسبيَ اللهُ لا إله إلا هو، عليه توكلتُ، وهو ربُّ العرش العظيم",
        initialCount = 7,
        "morning"
    ),
    Dhikr(
        text = "بسمِ الله الذي لا يضر مع اسمه شيء في الأرض ولا في السماء، وهو السميع العليم",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور",
        initialCount = 1,
        "morning"
    ),
    Dhikr(
        text = "أصبحنا على فطرة الإسلام، وعلى كلمة الإخلاص، وعلى دين نبينا محمد صلى الله عليه وسلم، وعلى ملة أبينا إبراهيم حنيفًا مسلمًا، وما كان من المشركين",
        initialCount = 1,
        "morning"
    ),
    Dhikr(
        text = "سبحان الله وبحمده، عدد خلقه، ورضا نفسه، وزنة عرشه، ومداد كلماته",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "اللهم عافني في بدني، اللهم عافني في سمعي، اللهمَّ عافني في بصري، لا إله إلا أنت",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "اللهمَّ إني أعوذ بك من الكفر، والفقر، اللهمَّ إني أعوذ بك من عذاب القبر، لا إله إلا أنت",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي وأهلي ومالي، اللهمَّ استر عوراتي، وآمن روعاتي، اللهمَّ احفظني من بين يدي، ومن خلفي، وعن يميني، وعن شمالي، ومِن فوقي، وأعوذ بعظمتك أن أغتال من تحتي",
        initialCount = 1,
        "morning"
    ),
    Dhikr(
        text = "يا حي يا قيوم برحمتك أستغيث، أصلح لي شأني كله، ولا تكلني إلى نفسي طرفة عين",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "أصبحنا وأصبح الملك لله رب العالمين، اللهم إني أسألك خير هذه اليوم: فتحه، ونصره، ونوره، وبركته، وهداه، وأعوذ بك من شر ما فيه وشر ما بعده",
        initialCount = 1,
        "morning"
    ),
    Dhikr(
        text = "اللهم عَالِمَ الغيب والشَّهادة، فاطر السموات والأرض، رب كل شيء ومليكه، أشهد أن لا إله إلا أنت أعوذ بك من شر نفسي ومن شر الشيطان وشركه وأن اقترف على نفسي سوءًا أو أجُره إلى مسلم",
        initialCount = 1,
        "morning"
    ),
    Dhikr(
        text = "أعوذ بكلمات الله التامات من شر ما خلق",
        initialCount = 3,
        "morning"
    ),
    Dhikr(
        text = "لا إله إلا الله، وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير",
        initialCount = 10,
        "morning"
    ),
    Dhikr(
        text = "                       سبحان الله وبحمده",
        initialCount = 100,
        "morning"
    )
)
